<a href="https://colab.research.google.com/github/subhajitmajumder/python_program/blob/master/me_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#**Pandas**

- Pandas is an open source library which is on top of Numpy.There are some advanced features from Numpy Library.
- Allows Data Cleaning, fast analysis, and Data Preparation.
- It also enhances performance and productivity.
- It has some built-in visualisation features.

Installation: **pip install pandas**

####Topics

- Series
- Dataframe
- Missing Data
- GroupBy
- Merging, Joining, Concatenating
- Operations
- Data input & output

###**Series**

In [0]:
import numpy as np
import pandas as pd

In [0]:
#Create various series from various object types.

data_1 = [50, 60, 70]
labels = ['a', 'b', 'c']
arr = np.array(data_1)
dic = {'a': 10, 'b': 20, 'c': 30}

In [5]:
pd.Series(data= data_1)  #showing all the data in data_1 with proper index.

0    50
1    60
2    70
dtype: int64

In [6]:
pd.Series(data= data_1, index= labels) #Set 'labels' list as index.

a    50
b    60
c    70
dtype: int64

In [7]:
pd.Series(data_1, labels) #No need to cast.

a    50
b    60
c    70
dtype: int64

In [8]:
#Passing any numpy array through pd.

pd.Series(data=arr)

0    50
1    60
2    70
dtype: int64

In [9]:
pd.Series(arr, labels)  #No need to cast once again.

a    50
b    60
c    70
dtype: int64

In [10]:
#Passing dictionaries in pandas

pd.Series(dic) #Index in left and values in right

a    10
b    20
c    30
dtype: int64

We can pass any type of data object as well as built-in functions.

In [11]:
pd.Series(data = [print, len, sum])

0    <built-in function print>
1      <built-in function len>
2      <built-in function sum>
dtype: object

In [12]:
series1 = pd.Series([1, 2, 3, 4], ['Pizza', 'chicken', 'Rice', 'Ghee'])
print(series1) #Here names are the indexes hich are the strings.

Pizza      1
chicken    2
Rice       3
Ghee       4
dtype: int64

In [13]:
series2 = pd.Series([2, 1, 4, 3], ['Rice', 'Pizza', 'Mutton', 'Ghee'])
print(series2)

Rice      2
Pizza     1
Mutton    4
Ghee      3
dtype: int64

In [14]:
#Can show the values by searching indexes.

series1['Rice']

3

In [15]:
series2['Ghee']

3

In [16]:
series1 + series2 #Adds the values of both series when it gets common else shows NaN

Ghee       7.0
Mutton     NaN
Pizza      2.0
Rice       5.0
chicken    NaN
dtype: float64

###**Dataframes**

In [0]:
from numpy.random import randn

In [0]:
np.random.seed(101) #.seed helps to provide same random numbers everytime.

- Creating a DataFrame

In [0]:
df = pd.DataFrame(randn(5, 4), ['A', 'B', 'C', 'D', 'E'],['W', 'X', 'Y', 'Z'])

In [20]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [21]:
type(df)

pandas.core.frame.DataFrame

- Indexing & Selection

In [22]:
df['W']  #Gets the W column.

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [23]:
type(df['W'])

pandas.core.series.Series

- When we request for a single column like above Python returns it as a series.

- In case of requesting multiple columns python returns it as a Dataframe.Check out the example below.

In [24]:
#Get multiple columns.

df[['W', 'Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [0]:
#Create new columns

df['New_Col'] = df['W'] + df['Z']  #need to add previous columns(any) to create a new column.
df

          W         X         Y         Z   New_Col
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [0]:
#Delete a column.

df.drop('New_Col', axis=1) #Axis method refers to rows or columns in a sheet.axis=0 is row and axis=1 is column

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [0]:
df

          W         X         Y         Z   New_Col
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

- **Drop** method doesnt affects the original dataframe.Pandas doesnt help users to loose data during any adjustments of Dataset.So to drop a column from original dataset there is a method called **inplace** which will drop the column from the original dataset when it is being set to True.

In [0]:
df.drop('New_Col', axis=1, inplace=True)

In [0]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [0]:
#Dropping a row.

df.drop('E') #Here no need to use axis=0 as it is the default value.

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [0]:
df  #As we didnt use inplace method so actual row is not being dropped.

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [0]:
df.shape #Get rows and columns count.

(5, 4)

In [0]:
#Get rows from a dataframe. (.loc) refers to the row position.

df.loc['A']  #note that a row is also a series.Pandas always returns a series either for rows or columns

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [0]:
#Get multiple rows from a dataframe.

df.loc[['A', 'B']]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965

In [25]:
#Get row from a dataframe by indexing. (.iloc refers to the index location)

df.iloc[2] #Gets row C as the index of row C is 2.

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [0]:
#Get single cell from a dataframe.
df.loc['C', 'Z']

-0.5890005332865824

In [0]:
#Get multiple cells at a time.

print(df)
print('\n')
df.loc[['A', 'D'], ['X', 'Z']]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

          X         Z
A  0.628133  0.503826
D -0.758872  0.955057

##**Dataframes Part 2**

In [0]:
np.random.seed(101)

In [0]:
df = pd.DataFrame(randn(5, 4), ['A', 'B', 'C', 'D', 'E'],['W', 'X', 'Y', 'Z'])

In [0]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

We can perform **Conditional Selection** which is one of the important features of Pandas Library.

In [0]:
df >0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [0]:
bool_df = df > 0
bool_df

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [0]:
df[bool_df] #Showing original values when it is true and NaN when it is false.

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [0]:
#Filtering rows with the help of column.
df['W'] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [0]:
df['W'] #Check this output with previous code block's output.
#The false result is in this case negative and others are positive.

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [0]:
#Another way to write the above code.We can filter out the rows based on the column value.

df[df['W'] > 0]  #In this case we only get those rows where the column W's value is > 0.Here Row C is excluded.

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [0]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [0]:
#Grab all the rows in this dataframe where Z is < 0.

result_df = df[df['Z'] > 0]
result_df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [0]:
# Grab columns from result_df.

result_df[['Y', 'W']]

          Y         W
A  0.907969  2.706850
B -0.848077  0.651118
D -0.933237  0.188695
E  2.605967  0.190794

In the above two cells we grab some rows depending on some general conditions.We can also grab one or multiple columns depending on the conditions which I have shown in cell no. 52. This entire process which is shown above can be executed in a single line, which I am showing below.

In [0]:
#Garb all the rows where 'W' > 0 and after satisfying the condition grab 'W' & 'Y'.

df[df['W'] > 0] [['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
D  0.188695 -0.933237
E  0.190794  2.605967

We can also use multiple conditions in pandas.For using multiple conditions we need either AND or OR operator.In case of Pandas library for AND we will use & and for OR we will use | sign.Check out the example below.

NB: '|' this operator is called pipe operatorr and is placed above the Enter key in any standard keyboard.

In [0]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [0]:
 df[(df['W'] > 0) & (df['X'] > 1)]  #Using & operator which is actually defined as AND

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [0]:
df[(df['X'] > 0) | (df['Y'] > 1)]  #Using | operator which is actually defined as OR

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

###**More about Index**

In [0]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [0]:
#Reset the index.
df.reset_index()  #Here index resets to a column.

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

We can insert a column in our dataframe from a string or from a list.Note that it will only execute if number of rows are same. Check the example below.

In [0]:
col_1 = "GH JK MN KO LM".split()  #Creating a list from a string.

In [0]:
col_1  # A list from string.

['GH', 'JK', 'MN', 'KO', 'LM']

In [0]:
df['new_column1'] = col_1 # Create a new column in our dataframe.
df

          W         X         Y         Z new_column1
A  2.706850  0.628133  0.907969  0.503826          GH
B  0.651118 -0.319318 -0.848077  0.605965          JK
C -2.018168  0.740122  0.528813 -0.589001          MN
D  0.188695 -0.758872 -0.933237  0.955057          KO
E  0.190794  1.978757  2.605967  0.683509          LM

In [0]:
# Set a column as an index.

df.set_index('new_column1')

                    W         X         Y         Z
new_column1
GH           2.706850  0.628133  0.907969  0.503826
JK           0.651118 -0.319318 -0.848077  0.605965
MN          -2.018168  0.740122  0.528813 -0.589001
KO           0.188695 -0.758872 -0.933237  0.955057
LM           0.190794  1.978757  2.605967  0.683509

#**Multi Index & Index Hierarchy**

In [0]:
import numpy as np
import pandas as pd

In [29]:
#Multi Index

outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']  # List 1
print(outside)
inside = [1, 2, 3, 1, 2, 3]  # list 2
print(inside)
index1 = list(zip(outside, inside))  # List of paired tuple one from outside & one from inside
print(index1)
index1 = pd.MultiIndex.from_tuples(index1)  # Take a list and create a multi index from the list.
print(index1)

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
[1, 2, 3, 1, 2, 3]
[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]
MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [30]:
# Create a dataframe using random numbers using index1 variable where X & Y are columns

df = pd.DataFrame(np.random.randn(6,2), index1,['X', 'Y'])  
df

             X         Y
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In the above case there are two level indexing.In level 1 its G1 & G2 indexing and in level 2 each G1 & G2 consists of 1 to 3 index.

###**Calling data from this multi level index.**

In [31]:
# Grab everything from the outside index.

df.loc['G1']  #From outside index G1, we grab all the rows and columns

          X         Y
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [32]:
df.loc['G1'].loc[1] # Grab all information from outside and inside index.

X    0.302665
Y    1.693723
Name: 1, dtype: float64

We can infact name all the indexes.Check the example below.

In [33]:
df

             X         Y
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [34]:
df.index.names  #No names of the index untill now.It shows none.

FrozenList([None, None])

In [35]:
df.index.names = ['Groups', 'Numbers'] # Outside index -> Groups, Inside Index -> Numbers
df

                       X         Y
Groups Numbers
G1     1        0.302665  1.693723
       2       -1.706086 -1.159119
       3       -0.134841  0.390528
G2     1        0.166905  0.184502
       2        0.807706  0.072960
       3        0.638787  0.329646

In [36]:
# Grab an individual cell from the dataframe.

df.loc['G2'].loc[2]['Y']  #Outside index -> Inside index -> Column name/Column Index

0.07295967531703869

**Returning the cross section of rows and columns**

In [37]:
#Lets grab everything under outside index G2

# Method 1
df.loc['G1']
df

#Method 2
df.xs('G1')

                X         Y
Numbers
1        0.302665  1.693723
2       -1.706086 -1.159119
3       -0.134841  0.390528

**.xs** has the ability to go inside a dataframe which has multilevel index.Lets jump to an example below.

In [38]:
# Grab all values of inside Index number 1 from both the outside index.

df.xs(1, level='Numbers')

               X         Y
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

#Missing Data

In [0]:
import numpy as np
import pandas as pd

In [0]:
 x = {'A': [1, 2, np.nan], 'B': [4, np.nan, np.nan], 'C': [1, 2, 3]}

In [4]:
df = pd.DataFrame(x)
print(df)

     A    B  C
0  1.0  4.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [5]:
#Drop every row or column which has Null value.

df.dropna() #by default it deletes row, to delete column we should use axis method

     A    B  C
0  1.0  4.0  1

In [6]:
 df.dropna(axis = 1)

   C
0  1
1  2
2  3

In [7]:
df.dropna(thresh=2) #Here row 2 has atleast 2 non NaN values

     A    B  C
0  1.0  4.0  1
1  2.0  NaN  2

In [8]:
#Replacing the missing values.

df.fillna(value='Fill it')

         A        B  C
0        1        4  1
1        2  Fill it  2
2  Fill it  Fill it  3

In [10]:
#Sometimes we use mean of a column to fill in the missing values.

df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

#Group By

In [0]:
import numpy as np
import pandas as pd

In [0]:
data = {'Company': ['Google', 'Google', 'Facebook', 'Microsoft', 'Facebook', 'Microsoft'],
        'Person': ['Peter', 'Koholi', 'Ram', 'Bob', 'Ramen', 'John'],
        'Sales': [100, 150, 200, 250, 300, 400]}

In [15]:
df = pd.DataFrame(data)
df

     Company  Person  Sales
0     Google   Peter    100
1     Google  Koholi    150
2   Facebook     Ram    200
3  Microsoft     Bob    250
4   Facebook   Ramen    300
5  Microsoft    John    400

In [0]:
 byCompany = df.groupby('Company')

In [19]:
print(byCompany)  #So groupby creates an object

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x7f82c37a4828>

Now we can perform different operations after using groupby

In [20]:
byCompany.mean()

           Sales
Company
Facebook     250
Google       125
Microsoft    325

In [21]:
byCompany.sum()

           Sales
Company
Facebook     500
Google       250
Microsoft    650

In [22]:
byCompany.std()

                Sales
Company
Facebook    70.710678
Google      35.355339
Microsoft  106.066017

In [24]:
#We can do more specific operations.

byCompany.sum().loc['Google']

Sales    250
Name: Google, dtype: int64

In [29]:
#We can do by using one liner code.

df.groupby('Company').sum().loc['Google']

Sales    250
Name: Google, dtype: int64

In [30]:
df.groupby('Company').min()

           Person  Sales
Company
Facebook      Ram    200
Google     Koholi    100
Microsoft     Bob    250

In [31]:
df.groupby('Company').describe()

          Sales
          count   mean         std    min    25%    50%    75%    max
Company
Facebook    2.0  250.0   70.710678  200.0  225.0  250.0  275.0  300.0
Google      2.0  125.0   35.355339  100.0  112.5  125.0  137.5  150.0
Microsoft   2.0  325.0  106.066017  250.0  287.5  325.0  362.5  400.0